[Killed] ArrowFunction
src/services/auth.service.js:18:48
     throw new ApiError(400, 'Os campos "email" e "senha" são obrigatórios.');
   }
 
-  const admin = db.all('administradores').find((a) => a.email === email);
+  const admin = db.all('administradores').find(() => undefined);
   const aluno = db.all('alunos').find((a) => a.email === email);
   const usuario = admin || aluno;
killedBy: Testes de Login External CT01: Deve retornar 200 e um token para credenciais válidas
statusReason: expected 401 to equal 200
