[Survived] BlockStatement
src/services/auth.service.js:7:30
 import ApiError from '../utils/ApiError.js';
 import { JWT_SECRET, JWT_EXPIRES_IN } from '../config/jwt.js';
 
-function gerarToken(usuario) {
-  return jwt.sign({ sub: usuario.id, role: usuario.role, nome: usuario.nome }, JWT_SECRET, {
-    expiresIn: JWT_EXPIRES_IN,
-  });
-}
+function gerarToken(usuario) {}
 
 export function login({ email, senha }) {

[Killed] BlockStatement
src/services/auth.service.js:13:41
   });
 }
 
-export function login({ email, senha }) {
-  if (!email || !senha) {
-    throw new ApiError(400, 'Os campos "email" e "senha" são obrigatórios.');
-  }
-
-  const admin = db.all('administradores').find((a) => a.email === email);
-  const aluno = db.all('alunos').find((a) => a.email === email);
-  const usuario = admin || aluno;
-
-  if (!usuario || !bcrypt.compareSync(senha, usuario.senha)) {
-    throw new ApiError(401, 'E-mail ou senha inválidos.');
-  }
-
-  return {
-    token: gerarToken(usuario),
-    usuario: {
-      id: usuario.id,
-      nome: usuario.nome,
-      email: usuario.email,
-      role: usuario.role,
-    },
-  };
-}
+export function login({ email, senha }) {}
 
 export default { login };
killedBy: Testes de Login: CT02: Deve retornar 400 quando o Email não for informado
statusReason: expected 200 to equal 400

[Killed] BooleanLiteral
src/services/auth.service.js:14:7
 }
 
 export function login({ email, senha }) {
-  if (!email || !senha) {
+  if (email || !senha) {
     throw new ApiError(400, 'Os campos "email" e "senha" são obrigatórios.');
   }
killedBy: Testes de Login: CT01: Deve retornar 200 quando o usuário e senha forem corretos
statusReason: expected 400 to equal 200

[Killed] ConditionalExpression
src/services/auth.service.js:14:7
 }
 
 export function login({ email, senha }) {
-  if (!email || !senha) {
+  if (true) {
     throw new ApiError(400, 'Os campos "email" e "senha" são obrigatórios.');
   }
killedBy: Testes de Login: CT01: Deve retornar 200 quando o usuário e senha forem corretos
statusReason: expected 400 to equal 200

[Killed] ConditionalExpression
src/services/auth.service.js:18:55
     throw new ApiError(400, 'Os campos "email" e "senha" são obrigatórios.');
   }
 
-  const admin = db.all('administradores').find((a) => a.email === email);
+  const admin = db.all('administradores').find((a) => false);
   const aluno = db.all('alunos').find((a) => a.email === email);
   const usuario = admin || aluno;
killedBy: Testes de Login: CT01: Deve retornar 200 quando o usuário e senha forem corretos
statusReason: expected 401 to equal 200

[Killed] ConditionalExpression
src/services/auth.service.js:18:55
     throw new ApiError(400, 'Os campos "email" e "senha" são obrigatórios.');
   }
 
-  const admin = db.all('administradores').find((a) => a.email === email);
+  const admin = db.all('administradores').find((a) => true);
   const aluno = db.all('alunos').find((a) => a.email === email);
   const usuario = admin || aluno;
killedBy: Testes de Login: CT04: Deve retornar 401 quando o Email for incorreto
statusReason: expected 200 to equal 401

[Survived] ConditionalExpression
src/services/auth.service.js:19:46
   }
 
   const admin = db.all('administradores').find((a) => a.email === email);
-  const aluno = db.all('alunos').find((a) => a.email === email);
+  const aluno = db.all('alunos').find((a) => true);
   const usuario = admin || aluno;
 

[Survived] ConditionalExpression
src/services/auth.service.js:19:46
   }
 
   const admin = db.all('administradores').find((a) => a.email === email);
-  const aluno = db.all('alunos').find((a) => a.email === email);
+  const aluno = db.all('alunos').find((a) => false);
   const usuario = admin || aluno;
 

[Killed] ConditionalExpression
src/services/auth.service.js:20:19
 
   const admin = db.all('administradores').find((a) => a.email === email);
   const aluno = db.all('alunos').find((a) => a.email === email);
-  const usuario = admin || aluno;
+  const usuario = true;
 
   if (!usuario || !bcrypt.compareSync(senha, usuario.senha)) {
killedBy: Testes de Login: CT01: Deve retornar 200 quando o usuário e senha forem corretos
statusReason: expected 500 to equal 200

[Killed] ConditionalExpression
src/services/auth.service.js:20:19
 
   const admin = db.all('administradores').find((a) => a.email === email);
   const aluno = db.all('alunos').find((a) => a.email === email);
-  const usuario = admin || aluno;
+  const usuario = false;
 
   if (!usuario || !bcrypt.compareSync(senha, usuario.senha)) {
killedBy: Testes de Login: CT01: Deve retornar 200 quando o usuário e senha forem corretos
statusReason: expected 401 to equal 200

[Killed] BlockStatement
src/services/auth.service.js:22:62
   const aluno = db.all('alunos').find((a) => a.email === email);
   const usuario = admin || aluno;
 
-  if (!usuario || !bcrypt.compareSync(senha, usuario.senha)) {
-    throw new ApiError(401, 'E-mail ou senha inválidos.');
-  }
+  if (!usuario || !bcrypt.compareSync(senha, usuario.senha)) {}
 
   return {
killedBy: Testes de Login: CT04: Deve retornar 401 quando o Email for incorreto
statusReason: expected 500 to equal 401

[Killed] ConditionalExpression
src/services/auth.service.js:22:7
   const aluno = db.all('alunos').find((a) => a.email === email);
   const usuario = admin || aluno;
 
-  if (!usuario || !bcrypt.compareSync(senha, usuario.senha)) {
+  if (true) {
     throw new ApiError(401, 'E-mail ou senha inválidos.');
   }
killedBy: Testes de Login: CT01: Deve retornar 200 quando o usuário e senha forem corretos
statusReason: expected 401 to equal 200

[Killed] StringLiteral
src/services/auth.service.js:23:29
   const usuario = admin || aluno;
 
   if (!usuario || !bcrypt.compareSync(senha, usuario.senha)) {
-    throw new ApiError(401, 'E-mail ou senha inválidos.');
+    throw new ApiError(401, "");
   }
 
killedBy: Testes de Login: CT04: Deve retornar 401 quando o Email for incorreto
statusReason: expected '' to equal 'E-mail ou senha inválidos.'

[Survived] ObjectLiteral
src/services/auth.service.js:26:10
     throw new ApiError(401, 'E-mail ou senha inválidos.');
   }
 
-  return {
-    token: gerarToken(usuario),
-    usuario: {
-      id: usuario.id,
-      nome: usuario.nome,
-      email: usuario.email,
-      role: usuario.role,
-    },
-  };
+  return {};
 }
 

[Survived] ObjectLiteral
src/services/auth.service.js:37:16
   };
 }
 
-export default { login };
+export default {};
 
