[Timeout] BlockStatement
src/controllers/auth.controller.js:4:55
 import asyncHandler from '../utils/asyncHandler.js';
 import * as authService from '../services/auth.service.js';
 
-export const login = asyncHandler(async (req, res) => {
-  res.json(authService.login(req.body));
-});
+export const login = asyncHandler(async (req, res) => {});
 

[Timeout] CallExpression
src/controllers/auth.controller.js:5:3
 import * as authService from '../services/auth.service.js';
 
 export const login = asyncHandler(async (req, res) => {
-  res.json(authService.login(req.body));
+  ;
 });
 
